Ran Plan for project: `sharedservices-prod` dir: `accounts/sharedservices-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_cloudfront_distribution.privacy_distribution will be created
+ resource "aws_cloudfront_distribution" "privacy_distribution" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "privacy.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_100"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "S3-privacy-feedutopia"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }

          + grpc_config (known after apply)
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "feedutopia-privacy.s3-website.us-east-2.amazonaws.com"
          + origin_id                = "S3-privacy-feedutopia"
            # (2 unchanged attributes hidden)

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "http-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-2:825765422855:certificate/8e28f7dc-9a39-43dc-b615-fcb4a8e4a2c8"
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_route53_record.privacy_record will be created
+ resource "aws_route53_record" "privacy_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "privacy.feedutopia.com"
      + type            = "A"
      + zone_id         = "Z0783926A0QGXSW1QXG0"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_s3_bucket_policy.privacy_policy will be created
+ resource "aws_s3_bucket_policy" "privacy_policy" {
      + bucket = "feedutopia-privacy"
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::feedutopia-privacy/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_s3_object.privacy_html will be created
+ resource "aws_s3_object" "privacy_html" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "feedutopia-privacy"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "privacy.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "path/to/privacy.html"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + version_id             = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p sharedservices-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fsharedservices-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p sharedservices-prod
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```